src/Catalogs/Scan_ДействияНаЗначимыеСобытия/Scan_ДействияНаЗначимыеСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ДействияНаЗначимыеСобытия</name>
  <comment>Определяет необходимые действия при наступлении значимого события</comment>
  <attributes>
    <name>SMSОтправлятьВТранслите</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSТекстСообщенияПроизвольныйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Пользователь создавший документ</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторПроизвольныйКод</name>
    <comment>Пользователь создавший документ</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПутьКДанным</name>
    <comment>Путь к данным, ссылке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность сообщения/письма</comment>
    <type>
      <types>EnumRef.Scan_Важность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВажностьПроизвольныйКод</name>
    <comment>Важность электронного письма (произвольный код)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДействия</name>
    <comment>Вид действия</comment>
    <type>
      <types>EnumRef.Scan_ВидДействияНаЗначимоеСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНапоминания</name>
    <comment>Дата начала напоминания</comment>
    <type>
      <types>String</types>
      <types>Date</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНапоминанияПроизвольныйКод</name>
    <comment>Дата напоминания произвольный код</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНапоминанияПутьКДанным</name>
    <comment>Дата напоминания путь к данным</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>жрДанные</name>
    <comment>Произвольные данные  (Журнал регистрации)</comment>
    <type>
      <types>String</types>
      <types>AnyRef</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>жрДанныеПроизвольныйКод</name>
    <comment>Произвольные данные</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>жрДанныеПутьКДанным</name>
    <comment>Путь к реквизитам объекта-источника</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>жрОбъектМетаданных</name>
    <comment>Строка, хранящая полный путь к объекту метаданных  (Журнал регистрации)</comment>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>жрОбъектМетаданныхИмяОбъекта</name>
    <comment>Строка, хранящая полный путь к объекту метаданных</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>жрОбъектМетаданныхПроизвольныйКод</name>
    <comment>Объект метаданных произвольный код</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>жрСобытие</name>
    <comment>Регистрируемое событие (Журнал регистрации)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>жрСобытиеПроизвольныйКод</name>
    <comment>Событие произвольный код</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>жрУровеньВажности</name>
    <comment>Уровень важности (Журнал регистрации)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадействоватьВводНаОсновании</name>
    <comment>Ввести объект на основании объекта-источника</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьРеквизитыПоУмолчанию</name>
    <comment>Признак использования для создаваемого объекта ссылочного типа механизма заполнения реквизитов по-умолчанию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениНапоминания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий документа</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПроизвольныйКод</name>
    <comment>Комментарий документа</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправитьSMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеТипаОбъекта</name>
    <comment>Представление типа объекта</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПровестиДокумент</name>
    <comment>В случае, если создается документ, этим реквизитом определяется, нужно ли его проводить.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКод</name>
    <comment>Произвольный код </comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <comment>Содержание (Напоминание)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроизвольныйКод</name>
    <comment>Содержание произвольный код</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиВремениНапоминания</name>
    <type>
      <types>EnumRef.Scan_ВидыПравил</types>
      <types>EnumRef.СпособыУстановкиВремениНапоминания</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема сообщения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПроизвольныйКод</name>
    <comment>Тема электронного сообщения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>Тип создаваемого объекта</comment>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>эпТекстПисьма</name>
    <comment>Текст электронного сообщения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>эпТекстПисьмаПроизвольныйКод</name>
    <comment>Текст электронного сообщения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>эпУчетнаяЗапись</name>
    <comment>Почтовый ящик с которого было принято/отправлено сообщение </comment>
    <type>
      <types>String</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>эпУчетнаяЗаписьПроизвольныйКод</name>
    <comment>Почтовый ящик с которого было принято/отправлено сообщение </comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>эпУчетнаяЗаписьПутьКДанным</name>
    <comment>Почтовый ящик с которого было принято/отправлено сообщение </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>эпФорматТекста</name>
    <comment>Вид текста почтового сообщения HTML, Простой текст</comment>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Соответствия</name>
    <comment>В табличной части хранятся соответствия</comment>
    <attributes>
      <name>ПредставлениеРеквизита</name>
      <comment>Представление реквизита</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитОбъекта</name>
      <comment>Реквизит объекта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПравила</name>
      <type>
        <types>EnumRef.Scan_ВидыПравил</types>
      </type>
    </attributes>
    <attributes>
      <name>Правило</name>
      <comment>Представление правила</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <comment>Путь к данным</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизвольныйКод</name>
      <comment>произвольный код</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиНапоминания</name>
    <comment>В табличной части хранятся получатели напоминания</comment>
    <attributes>
      <name>ВидПравила</name>
      <comment>Вид правила</comment>
      <type>
        <types>EnumRef.Scan_ВидыПравил</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <comment>Путь к данным</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизвольныйКод</name>
      <comment>Произвольный код</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <comment>В табличной части хранятся получатели сообщения (Поля письма &quot;Кому&quot;, &quot;Копии&quot; и &quot;Скрытые копии&quot;)</comment>
    <attributes>
      <name>ВидПравила</name>
      <comment>Вид правила</comment>
      <type>
        <types>EnumRef.Scan_ВидыПравил</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <comment>Электронный адрес получателя</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроизвольныйКод</name>
      <comment>Произвольный код</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>Представление получателя сообщения</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодГруппыАдреса</name>
      <comment>Определяет группу адреса</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаОбъект</name>
      <comment>Если E-mail принадлежит контрагенту или контактному лицу, то здесь содержится ссылка на этот объект</comment>
      <type>
        <types>CatalogRef.Scan_Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.Scan_Сотрудники</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Активность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПечатнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФорматПФ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковатьВАрхив</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПечатнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяОбъектовМетаданныхМакета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_ДействияНаЗначимыеСобытия/ManagerModule.bsl
// Модуль менеджера справочника "Действия на значимые события"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределённых элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// Дозаполим события после переноса данных
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДействияНаЗначимыеСобытия.Ссылка,
	               |	ДействияНаЗначимыеСобытия.ПредставлениеТипаОбъекта,
	               |	ДействияНаЗначимыеСобытия.жрОбъектМетаданныхИмяОбъекта,
	               |	ДействияНаЗначимыеСобытия.ТипОбъекта,
	               |	ДействияНаЗначимыеСобытия.жрОбъектМетаданных
	               |ИЗ
	               |	Справочник.Scan_ДействияНаЗначимыеСобытия КАК ДействияНаЗначимыеСобытия
	               |ГДЕ
	               |	(ДействияНаЗначимыеСобытия.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	               |				И НЕ ДействияНаЗначимыеСобытия.ПредставлениеТипаОбъекта = """"
	               |			ИЛИ ДействияНаЗначимыеСобытия.жрОбъектМетаданных = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	               |				И НЕ ДействияНаЗначимыеСобытия.жрОбъектМетаданныхИмяОбъекта = """")";
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Сохранение справочника
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторОбъектаМетаданных = Неопределено;
		ДействияНаЗначимыеСобытияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ ЗначениеЗаполнено(Выборка.ТипОбъекта) И НЕ Метаданные.НайтиПоПолномуИмени(Выборка.ПредставлениеТипаОбъекта) = Неопределено Тогда
			ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Выборка.ПредставлениеТипаОбъекта);
			ДействияНаЗначимыеСобытияОбъект.ТипОбъекта = ИдентификаторОбъектаМетаданных;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Выборка.жрОбъектМетаданных) И НЕ Метаданные.НайтиПоПолномуИмени(Выборка.жрОбъектМетаданныхИмяОбъекта) = Неопределено Тогда
			ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Выборка.жрОбъектМетаданныхИмяОбъекта);
			ДействияНаЗначимыеСобытияОбъект.жрОбъектМетаданных = ИдентификаторОбъектаМетаданных;
			ДействияНаЗначимыеСобытияОбъект.жрОбъектМетаданныхИмяОбъекта = ИдентификаторОбъектаМетаданных;
		КонецЕсли;
		
		Попытка
			ДействияНаЗначимыеСобытияОбъект.Записать();
			ВывестиСообщениеПол(НСтр("ru='Справочник ""Действия на значимые события"". %1 элемент ""%2""'"),,,,,"Обновлен",Выборка.Ссылка);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

//Формирует стандартное наименование и представление карточки.
//
// Параметры:
//  Объект   - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Процедура СформироватьНаименованиеПоУмолчанию(Объект,ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ВидДействия=Перечисления.Scan_ВидДействияНаЗначимоеСобытие.СоздатьИЗаписатьОбъект Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ТипОбъекта) Тогда
			Возврат;
		КонецЕсли;
		Если Объект.ТипОбъекта.ПорядокКоллекции = 0 Тогда
			Автонаименование = "Установить значение константы";
			
		ИначеЕсли Объект.ТипОбъекта.ПорядокКоллекции = 12 Тогда
			Автонаименование = "Создать запись регистра сведений";
			
		Иначе
			Автонаименование = "Создать объект <" + Объект.ТипОбъекта + ">";
		КонецЕсли;
		
	ИначеЕсли Объект.ВидДействия=Перечисления.Scan_ВидДействияНаЗначимоеСобытие.СоздатьНапоминание Тогда
		
		Автонаименование = "Создать напоминание";
		
	ИначеЕсли Объект.ВидДействия=Перечисления.Scan_ВидДействияНаЗначимоеСобытие.СоздатьЗаписьЖурналаРегистрации Тогда
		
		Автонаименование = "Создать запись в журнале регистрации";
		
	ИначеЕсли Объект.ВидДействия=Перечисления.Scan_ВидДействияНаЗначимоеСобытие.НаписатьЭлектронноеПисьмо Тогда
		
		Автонаименование = "Написать электронное письмо";
	ИначеЕсли Объект.ВидДействия=Перечисления.Scan_ВидДействияНаЗначимоеСобытие.НаписатьЭлектронноеПисьмоСВложением Тогда
		
		Автонаименование = "Написать электронное письмо с вложением";
		
	КонецЕсли;
	
	Объект.Наименование = Автонаименование;
	
КонецПроцедуры // СформироватьНаименованиеПоУмолчанию()

// Обработчик события вызывается на сервере при получении стандартной управляемой формы.
//
// Параметры:
//  ВидФормы - Строка - Имя стандартной формы.
//  Параметры - Структура - Параметры формы.
//  ВыбраннаяФорма - Содержит имя открываемой формы или объект метаданных Форма.
//  ДополнительнаяИнформация - Структура - Дополнительная информация открытия формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") ИЛИ ВидФормы = "ФормаОбъекта" И Параметры.Свойство("ЗначениеКопирования") И ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.ДействияНаЗначимыеСобытия") Тогда
		
		Если Параметры.Свойство("Ключ") Тогда
			ВидДействия = Параметры.Ключ.ВидДействия;
		Иначе
			ВидДействия = Параметры.ЗначениеКопирования.ВидДействия;
			ДополнительнаяИнформация.Вставить("ЗначениеКопирования", Параметры.ЗначениеКопирования);
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Если ВидДействия = Перечисления.Scan_ВидДействияНаЗначимоеСобытие.НаписатьЭлектронноеПисьмо Тогда
			ВыбраннаяФорма = "ФормаЭлектронногоПисьма";
		ИначеЕсли ВидДействия = Перечисления.Scan_ВидДействияНаЗначимоеСобытие.СоздатьИЗаписатьОбъект Тогда
			ВыбраннаяФорма = "ФормаСозданияОбъекта";
		ИначеЕсли ВидДействия = Перечисления.Scan_ВидДействияНаЗначимоеСобытие.СоздатьЗаписьЖурналаРегистрации Тогда
			ВыбраннаяФорма = "ФормаСозданияЗаписиВЖурналРегистрации";
		ИначеЕсли ВидДействия = Перечисления.Scan_ВидДействияНаЗначимоеСобытие.СоздатьНапоминание Тогда
			ВыбраннаяФорма = "ФормаСоздатьНапоминание";
		ИначеЕсли ВидДействия = Перечисления.Scan_ВидДействияНаЗначимоеСобытие.НаписатьЭлектронноеПисьмоСВложением Тогда
			ВыбраннаяФорма = "ФормаЭлектронногоПисьмаСВложением";
		ИначеЕсли ВидДействия = Перечисления.Scan_ВидДействияНаЗначимоеСобытие.Прочее Тогда
			ВыбраннаяФорма = "ФормаПроизвольноеВыражение";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //ОбработкаПолученияФормы()

//Формирует стандартное текст в зависимосте от выбранного поля.
//
// Параметры:
//  ПереданныйТекст   - Строка - Первоначальный текст.
//
Функция ОчиститьСодержимоеРедактора(Текст) Экспорт
	
	ПроизвольныйКод = "";
	Если Текст="Соответствия" Тогда
		
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ЗначениеРеквизита> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Значение это переменной будет присвоено соответствующему реквизиту создаваемого объекта.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "ЗначениеРеквизита = """";"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС;
		
	ИначеЕсли Текст="Получатели" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Пользователь> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать ссылку на элемент справочника ""Пользователи"",";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// либо массив элементов справочника ""Пользователи"".";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Пользователь = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС;  
		
	ИначеЕсли Текст="ДатаНапоминания" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ДатаНапоминания> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать значение даты.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "ДатаНапоминания = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="Содержание" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Содержание> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать текст напоминания.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Содержание = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="Событие" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Событие> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать текст события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Событие = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст ="ОбъектМетаданных" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектМетаданных> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать объект метаданных.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "ОбъектМетаданных = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="жрКомментарий" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Комментарий> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать текст комментария.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Комментарий = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="Данные" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Данные> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать ссылку на объект (любой).";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Данные = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="Автор" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Автор> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать ссылку на элемент справочника ""Пользователи"".";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Автор = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС;
		
	ИначеЕсли Текст="Тема" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Тема> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать текст темы электронного письма.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Тема = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="УчетнаяЗапись" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <УчетнаяЗапись> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать ссылку на элемент справочника ""Учетные записи электронной почты"".";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "УчетнаяЗапись = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="Комментарий" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Комментарий> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать текст комментария.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Комментарий = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="Важность" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Важность> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, по значению этой переменной будет определятся важность электронного письма.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Важность = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС;
	
	ИначеЕсли Текст="ТекстПисьма" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекстПисьма> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать текст электронного письма.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "ТекстПисьма = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="ТекстСообщения" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекстСообщения> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать текст электронного письма.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "ТекстСообщения = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
	ИначеЕсли Текст="АдресЭлектроннойПочты" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <АдресЭлектроннойПочты> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать адрес получателя электронного письма.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "АдресЭлектроннойПочты = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС;
		
	ИначеЕсли Текст="Телефон" Тогда
		ПроизвольныйКод = "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// Предусмотрены несколько предопределенных переменных:";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <Телефон> - обязательная переменная.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// После выполнения кода, эта переменная должна содержать телефон получателя сообщения SMS.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "//";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ОбъектИсточник> - предназначена для доступа к объекту-источнику события.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <ТекущийОбъект>  - предназначена для доступа к создаваемому объекту.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "// <СозданныеОбъекты> - массив уже созданных объектов в предшествующих действиях.";
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС + "/////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС; 
		
		ПроизвольныйКод = ПроизвольныйКод + "Телефон = Неопределено;"; 
		ПроизвольныйКод = ПроизвольныйКод + Символы.ПС;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ПроизвольныйКод) Тогда
		Возврат Текст;
	Иначе
		Возврат ПроизвольныйКод;
	КонецЕсли;
КонецФункции // ОчиститьСодержимоеРедактора()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ВидДействия");
	
	
	
		
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Заполнить реквизиты по умолчанию".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ЗаполнитьРеквизитыПоУмолчаниюПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ЗаполнитьРеквизитыПоУмолчанию Тогда
		Объект.ЗадействоватьВводНаОсновании = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРеквизитыПоУмолчаниюПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Задействовать ввод на основании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ЗадействоватьВводНаОснованииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ЗадействоватьВводНаОсновании Тогда
		Объект.ЗаполнитьРеквизитыПоУмолчанию = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ЗадействоватьВводНаОснованииПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()
